#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIOptimizer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum AIOptimizer.EAIOStartSpawningMethod
// NumValues: 0x0005
enum class EAIOStartSpawningMethod : uint8
{
	None                                     = 0,
	SpawnOnGameStart                         = 1,
	SpawnOnRadius                            = 2,
	SpawnOnRegion                            = 3,
	EAIOStartSpawningMethod_MAX              = 4,
};

// Enum AIOptimizer.EAIOSpawnPointsProjectionMethod
// NumValues: 0x0004
enum class EAIOSpawnPointsProjectionMethod : uint8
{
	None                                     = 0,
	Geometry                                 = 1,
	Navigation                               = 2,
	EAIOSpawnPointsProjectionMethod_MAX      = 3,
};

// Enum AIOptimizer.EAIORespawnMethod
// NumValues: 0x0004
enum class EAIORespawnMethod : uint8
{
	Undefined                                = 0,
	AllAtOnce                                = 1,
	EachIndividually                         = 2,
	EAIORespawnMethod_MAX                    = 3,
};

// Enum AIOptimizer.EAIOSelectSpawnPointsMethod
// NumValues: 0x0003
enum class EAIOSelectSpawnPointsMethod : uint8
{
	UseRandomPoints                          = 0,
	UseSpecifiedSpawnPoints                  = 1,
	EAIOSelectSpawnPointsMethod_MAX          = 2,
};

// Enum AIOptimizer.EAIODebugGroup
// NumValues: 0x000A
enum class EAIODebugGroup : uint8
{
	Undefined                                = 0,
	Spawned                                  = 1,
	Despawned                                = 2,
	PendingSpawn                             = 3,
	PendingDespawn                           = 4,
	SpawnedClose                             = 5,
	SpawnedMedium                            = 6,
	SpawnedFar                               = 7,
	NotUpdated                               = 8,
	EAIODebugGroup_MAX                       = 9,
};

// Enum AIOptimizer.EAIOFeaturesFlags
// NumValues: 0x0008
enum class EAIOFeaturesFlags : uint8
{
	AIBrain                                  = 0,
	MovementComponent                        = 1,
	Visibility                               = 2,
	Collision                                = 3,
	Animations                               = 4,
	ActorTick                                = 5,
	Shadows                                  = 6,
	EAIOFeaturesFlags_MAX                    = 7,
};

// Enum AIOptimizer.EDespawnMethod
// NumValues: 0x0003
enum class EDespawnMethod : uint8
{
	UseQueue                                 = 0,
	Immediately                              = 1,
	EDespawnMethod_MAX                       = 2,
};

// ScriptStruct AIOptimizer.AIOSpawnPoint
// 0x0030 (0x0030 - 0x0000)
struct FAIOSpawnPoint final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIOSpawnPoint;

// ScriptStruct AIOptimizer.AIOPendingSpawnGroup
// 0x0008 (0x0008 - 0x0000)
struct FAIOPendingSpawnGroup final
{
public:
	int32                                         SpawnedAmount;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalAmountToSpawn;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIOPendingSpawnGroup;

// ScriptStruct AIOptimizer.AIOPendingRespawnGroup
// 0x000C (0x000C - 0x0000)
struct FAIOPendingRespawnGroup final
{
public:
	float                                         SpawnGameTime;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIOPendingSpawnGroup                  SpawnGroup;                                        // 0x0004(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIOPendingRespawnGroup;

// ScriptStruct AIOptimizer.AIODebugSubjectData
// 0x0028 (0x0028 - 0x0000)
struct FAIODebugSubjectData final
{
public:
	int32                                         Layer;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SubjectLocation;                                   // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InvokerLocation;                                   // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsSpawned : 1;                                    // 0x001C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsPending : 1;                                    // 0x001C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bNotUpdated : 1;                                   // 0x001C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsSeen : 1;                                       // 0x001C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceToInvoker;                                 // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DespawnRadius;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIODebugSubjectData;

// ScriptStruct AIOptimizer.AIOptimizationLayer
// 0x0008 (0x0008 - 0x0000)
struct FAIOptimizationLayer final
{
public:
	float                                         LayerRadius;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIOptimizationLayer;

// ScriptStruct AIOptimizer.AIOInvoker
// 0x0008 (0x0008 - 0x0000)
struct FAIOInvoker final
{
public:
	class UAIOInvokerComponent*                   Component;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIOInvoker;

// ScriptStruct AIOptimizer.AIOSubject
// 0x0010 (0x0010 - 0x0000)
struct FAIOSubject final
{
public:
	class UAIOSubjectComponent*                   Component;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIOSubject;

// ScriptStruct AIOptimizer.AIOSubjectHandle
// 0x0004 (0x0004 - 0x0000)
struct FAIOSubjectHandle final
{
public:
	int32                                         HandleId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIOSubjectHandle;

// ScriptStruct AIOptimizer.AIODespawnedSubject
// 0x0060 (0x0060 - 0x0000)
struct FAIODespawnedSubject final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     Class;                                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnRadiusSquared;                                // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Priority;                                          // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIOData_Base*                          Data;                                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIOSubjectHandle                      Handle;                                            // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bIsForcedToSpawn : 1;                              // 0x004C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanBeRespawnedOnlyByHandle : 1;                   // 0x004C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Spawner;                                           // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIODespawnedSubject;

}

