#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Backroom_P320_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Weapon_Master_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Backroom_P320_BP.Backroom_P320_BP_C
// 0x0028 (0x04A8 - 0x0480)
class ABackroom_P320_BP_C final : public AWeapon_Master_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Backroom_P320_BP_C;                 // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Bullet2;                                           // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bullet1;                                           // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP320_Anim_C*                           As_P320_Anim;                                      // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimMontage*                           Montage_to_Play;                                   // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Backroom_P320_BP(int32 EntryPoint);
	void 开始换弹();
	void ReceiveBeginPlay();
	void 停止蒙太奇();
	void CheckMagazine();
	void CheckChamber();
	void 是否是空仓状态(bool 空仓换弹);
	void 武器子弹空仓动画();
	void 播放射击();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Backroom_P320_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Backroom_P320_BP_C")
	}
	static class ABackroom_P320_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABackroom_P320_BP_C>();
	}
};
DUMPER7_ASSERTS_ABackroom_P320_BP_C;

}

