#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Backroom_Quest_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Backroom_Quest_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Backroom_Quest_BP.Backroom_Quest_BP_C
// 0x0048 (0x0268 - 0x0220)
class ABackroom_Quest_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBackroom_Quest                               Quest;                                             // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           PlayerRef;                                         // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          是否需要关闭卷帘门;                       // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADrawersSlot_BP_C*>              Drawers;                                           // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ADrawersSlot_BP_C*                      把手要生成的位置;                          // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADrawersSlot_BP_C*                      生成的子弹位置; // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Backroom_Quest_BP(int32 EntryPoint);
	void 女研究员打开第二道门后();
	void RefreshQuest();
	void 刷新任务();
	void ReceiveBeginPlay();
	void EndTalk();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Backroom_Quest_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Backroom_Quest_BP_C")
	}
	static class ABackroom_Quest_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABackroom_Quest_BP_C>();
	}
};
DUMPER7_ASSERTS_ABackroom_Quest_BP_C;

}

