#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LockComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LockComponent.BP_LockComponent_C
// 0x0028 (0x00D8 - 0x00B0)
class UBP_LockComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Locked_;                                           // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LockDifficulty;                                    // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ObjectName;                                        // 0x00C0(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_LockComponent(int32 EntryPoint);
	void SetHUDInfo(class UUI_LockpickingHUD_C* HUD);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LockComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LockComponent_C")
	}
	static class UBP_LockComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_LockComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_LockComponent_C;

}

