#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChineseZombieBloodBar_UMG

#include "Basic.hpp"


namespace SDK::Params
{

// Function ChineseZombieBloodBar_UMG.ChineseZombieBloodBar_UMG_C.ExecuteUbergraph_ChineseZombieBloodBar_UMG
// 0x0018 (0x0018 - 0x0000)
struct ChineseZombieBloodBar_UMG_C_ExecuteUbergraph_ChineseZombieBloodBar_UMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AChinese_Vampire_BP_C*                  CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ChineseZombieBloodBar_UMG_C_ExecuteUbergraph_ChineseZombieBloodBar_UMG;

// Function ChineseZombieBloodBar_UMG.ChineseZombieBloodBar_UMG_C.GetPercent_0
// 0x000C (0x000C - 0x0000)
struct ChineseZombieBloodBar_UMG_C_GetPercent_0 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ChineseZombieBloodBar_UMG_C_GetPercent_0;

}

