#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChineseAlleyQuest_BP

#include "Basic.hpp"

#include "ChineseAlley_Quest_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ChineseAlleyQuest_BP.ChineseAlleyQuest_BP_C
// 0x0038 (0x0258 - 0x0220)
class AChineseAlleyQuest_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EChineseAlley_Quest                           Quest;                                             // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           PlayerRef;                                         // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AChinese_Vampire_BP_C*                  ChineseVcampireRef;                                // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChineseZombieBloodBar_UMG_C*           中国僵尸血条; // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestTips_UMG_C*                       任务提示_UMG;                                  // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChineseAlleyQuest_BP(int32 EntryPoint);
	void 开始游戏();
	void 僵尸出场动画结束();
	void 刷新任务();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ChineseAlleyQuest_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChineseAlleyQuest_BP_C")
	}
	static class AChineseAlleyQuest_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChineseAlleyQuest_BP_C>();
	}
};
DUMPER7_ASSERTS_AChineseAlleyQuest_BP_C;

}

