#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomMapping_Slot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CustomMapping_Slot.CustomMapping_Slot_C.ExecuteUbergraph_CustomMapping_Slot
// 0x01A8 (0x01A8 - 0x0000)
struct CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0008(0x0070)(ConstParm)
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey_1;          // 0x0078(0x0020)(HasGetValueTypeHash)
	class FText                                   CallFunc_FindText_ReturnValue;                     // 0x0098(0x0018)()
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey;            // 0x00B0(0x0020)(HasGetValueTypeHash)
	class FText                                   CallFunc_FindText_ReturnValue_1;                   // 0x00D0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_1;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0100(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0138(0x0070)(ConstParm)
};
DUMPER7_ASSERTS_CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot;

// Function CustomMapping_Slot.CustomMapping_Slot_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct CustomMapping_Slot_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_CustomMapping_Slot_C_OnMouseEnter;

// Function CustomMapping_Slot.CustomMapping_Slot_C.BndEvt__CustomMapping_Slot_InputKeySelector2_K2Node_ComponentBoundEvent_4_OnKeySelected__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector2_K2Node_ComponentBoundEvent_4_OnKeySelected__DelegateSignature final
{
public:
	struct FInputChord                            SelectedKey;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector2_K2Node_ComponentBoundEvent_4_OnKeySelected__DelegateSignature;

// Function CustomMapping_Slot.CustomMapping_Slot_C.BndEvt__CustomMapping_Slot_InputKeySelector1_K2Node_ComponentBoundEvent_2_OnKeySelected__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector1_K2Node_ComponentBoundEvent_2_OnKeySelected__DelegateSignature final
{
public:
	struct FInputChord                            SelectedKey;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector1_K2Node_ComponentBoundEvent_2_OnKeySelected__DelegateSignature;

// Function CustomMapping_Slot.CustomMapping_Slot_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct CustomMapping_Slot_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_CustomMapping_Slot_C_OnMouseLeave;

// Function CustomMapping_Slot.CustomMapping_Slot_C.RemoveMapping
// 0x0078 (0x0078 - 0x0000)
struct CustomMapping_Slot_C_RemoveMapping final
{
public:
	struct FInputChord                            InputChord;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping;           // 0x0028(0x0028)()
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping;             // 0x0050(0x0028)()
};
DUMPER7_ASSERTS_CustomMapping_Slot_C_RemoveMapping;

// Function CustomMapping_Slot.CustomMapping_Slot_C.AddMapping
// 0x0078 (0x0078 - 0x0000)
struct CustomMapping_Slot_C_AddMapping final
{
public:
	struct FInputChord                            InputChord;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping;           // 0x0028(0x0028)()
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping;             // 0x0050(0x0028)()
};
DUMPER7_ASSERTS_CustomMapping_Slot_C_AddMapping;

// Function CustomMapping_Slot.CustomMapping_Slot_C.FindText
// 0x0070 (0x0070 - 0x0000)
struct CustomMapping_Slot_C_FindText final
{
public:
	class UInputKeySelector*                      目标;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          ___bool_Variable;                                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsSelectingKey_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_1;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsValid_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0028(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0058(0x0018)()
};
DUMPER7_ASSERTS_CustomMapping_Slot_C_FindText;

}

