#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomCharacterUMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CharacterModel_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CustomCharacterEnum_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CustomCharacterUMG.CustomCharacterUMG_C
// 0x0D40 (0x0FA0 - 0x0260)
class UCustomCharacterUMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       服装显示淡入Anim;                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewYearGirlClothAnim;                              // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MaidClothAnim;                                     // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AmayaClothAnim;                                    // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ModAnim;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CharacterAnim;                                     // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class U选择自定义人物_C*               BunnyGril_1;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             CharacterSelect;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C*               Female_1;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C*               JuaLee;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C*               LadyBiker;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C*               Maid_1;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C*               Man_1;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C*         MOD;                                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ModSelect_1;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C*               NewYearGirl;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C*               Nun;                                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C*               SchoolGril_1;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C*               Soldier;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      UniformGridPanel_1;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG_C*                    下一步; // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C*         人物选择;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C*         头发选择;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             显示的服装; // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C*         衣服选择;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C*         裤子选择;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReturnButton_UMG_C*                    返回按钮;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C*         面部选择;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C*         鞋子选择;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         列; // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         行; // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterModel                               CharacterModel;                                    // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UTexture2D*, class USkeletalMesh*> Man衣服;                                         // 0x0368(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> BunnyGir头发;                                    // 0x03B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> SchoolGir裤子;                                   // 0x0408(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> SchoolGir衣服;                                   // 0x0458(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> SchoolGir袜子;                                   // 0x04A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ACustomCharacter_C*                     CustomCharacterRef;                                // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UTexture2D*, class USkeletalMesh*> Female衣服;                                      // 0x0500(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Female裤子;                                      // 0x0550(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Female面部;                                      // 0x05A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Female鞋子;                                      // 0x05F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Female头发;                                      // 0x0640(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Man裤子;                                         // 0x0690(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Man帽子;                                         // 0x06E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Man鞋子;                                         // 0x0730(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Man面部;                                         // 0x0780(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> BunnyGir衣服;                                    // 0x07D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> BunnyGir丝袜;                                    // 0x0820(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Maid衣服;                                        // 0x0870(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Amaya衣服;                                       // 0x08C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> NewYearGril衣服;                                 // 0x0910(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> BunnyGir鞋子;                                    // 0x0960(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> BunnyGir头饰;                                    // 0x09B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Maid头发;                                        // 0x0A00(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Maid丝袜;                                        // 0x0A50(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Maid鞋子;                                        // 0x0AA0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> LadyBiker头盔;                                   // 0x0AF0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> LadyBiker衣服;                                   // 0x0B40(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> LadyBiker裤子;                                   // 0x0B90(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Soldier衣服;                                     // 0x0BE0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Soldier裤子;                                     // 0x0C30(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Soldier头盔;                                     // 0x0C80(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Soldier鞋子;                                     // 0x0CD0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Soldier防弹衣; // 0x0D20(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> JuaLee衣服;                                      // 0x0D70(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> JuaLee头发;                                      // 0x0DC0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> JuaLee鞋子;                                      // 0x0E10(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Nun衣服;                                         // 0x0E60(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Nun丝袜;                                         // 0x0EB0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Nun头发;                                         // 0x0F00(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Nun鞋子;                                         // 0x0F50(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CustomCharacterUMG(int32 EntryPoint);
	void Construct();
	void BndEvt__CustomCharacterUMG_返回按钮_K2Node_ComponentBoundEvent_1_Click__DelegateSignature();
	void 面部UI刷新();
	void BndEvt__CustomCharacterUMG_自定义按钮_K2Node_ComponentBoundEvent_0_Click__DelegateSignature();
	void 衣服UI刷新();
	void ModUI刷新();
	void 初始化自定义服装选中();
	void 头发UI刷新();
	void 鞋子UI刷新();
	void 裤子UI刷新();
	void 人物UI刷新();
	void 关闭所有换装UI交互();
	ESlateVisibility Get_自定义按钮_Visibility_0();
	void 展示可更换服装(const TMap<class UTexture2D*, class USkeletalMesh*>& TargetMap, ECustomCharacterEnum CustomCharacterEnum);
	void 刷新部位名字();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CustomCharacterUMG_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomCharacterUMG_C")
	}
	static class UCustomCharacterUMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomCharacterUMG_C>();
	}
};
DUMPER7_ASSERTS_UCustomCharacterUMG_C;

}

