#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Destination_UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Destination_UMG.Destination_UMG_C
// 0x0040 (0x02A0 - 0x0260)
class UDestination_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Tip;                                               // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_64;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetPosition;                                    // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   单位;                                            // 0x0288(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_Destination_UMG(int32 EntryPoint);
	void Construct();
	void QuestDistance(class AActor* 目标点, const struct FTransform& T, class AActor* 玩家位置);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Destination_UMG_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Destination_UMG_C")
	}
	static class UDestination_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDestination_UMG_C>();
	}
};
DUMPER7_ASSERTS_UDestination_UMG_C;

}

