#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DifficultySelectionSlot_UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameDifficultyEnum_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DifficultySelectionSlot_UMG.DifficultySelectionSlot_UMG_C
// 0x0060 (0x02C0 - 0x0260)
class UDifficultySelectionSlot_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       交互;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_131;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_137;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0280(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	EGameDifficultyEnum                           游戏难度;                                      // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerStateSetting_C*                  PlayerSetting;                                     // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   难度描述;                                      // 0x02A8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_DifficultySelectionSlot_UMG(int32 EntryPoint);
	void Reset();
	void 结束悬停();
	void SettingDetails(const class FText& 标题, const class FText& 详情);
	void initializeSetting();
	void BndEvt__难度选择按钮_Button_131_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_131_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_131_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void CustomMappingCheck(const struct FInputActionKeyMapping& InputAction, const struct FInputAxisKeyMapping& InputAxis);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DifficultySelectionSlot_UMG_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DifficultySelectionSlot_UMG_C")
	}
	static class UDifficultySelectionSlot_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDifficultySelectionSlot_UMG_C>();
	}
};
DUMPER7_ASSERTS_UDifficultySelectionSlot_UMG_C;

}

