#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_DroneSettings

#include "Basic.hpp"

#include "Enum_Resolution_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_DroneSettings.F_DroneSettings
// 0x002C (0x002C - 0x0000)
struct FF_DroneSettings final
{
public:
	float                                         ZoomMin_3_CC5F69E34C3F38BF3D1A2AAE4BC7D885;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZoomMax_5_77C13836471DC0D20CCBE6A6957B514A;        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZoomSpeed_17_2D37EE2B4CBE8AAAD420CF91DCBCE0E7;     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentSpeed_7_C5D583574AD179DE14E95FA521D10FA0;   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSpeed_9_1ECE8BDD46B7382266C57EBD71CCD9D7;       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PitchMin_11_2362BDBA45DBFBB238A612801B36AACC;      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PitchMax_13_55B60DD54349778799F796B315FF2ED7;      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSignal_15_02E2F2A646D57F041EBFC1B5DA76A666;     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentBattery_19_3E0FF059478EF53BF545C98869702013; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxBattery_21_1BC057F24DDEB6CB47B7499CA7130AA6;    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Resolution                               Resolution_24_06B0521E48102F219DCB62AB8EF5AB65;    // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FF_DroneSettings;

}

