#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ghost_GrandMa_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Ghost_GrandMa_Anim.Ghost_GrandMa_Anim_C
// 0x0170 (0x0430 - 0x02C0)
class UGhost_GrandMa_Anim_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x02F8(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03E0(0x0048)()
	float                                         Speed;                                             // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Ghost_GrandMa_Anim(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Ghost_GrandMa_Anim_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Ghost_GrandMa_Anim_C")
	}
	static class UGhost_GrandMa_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGhost_GrandMa_Anim_C>();
	}
};
DUMPER7_ASSERTS_UGhost_GrandMa_Anim_C;

}

