#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InventoryData_Struct

#include "Basic.hpp"

#include "DS_PickUpType_structs.hpp"
#include "ItemType_Enum_structs.hpp"
#include "WeaponType_structs.hpp"
#include "BulletType_Enum_structs.hpp"


namespace SDK
{

// UserDefinedStruct InventoryData_Struct.InventoryData_Struct
// 0x0098 (0x0098 - 0x0000)
struct FInventoryData_Struct final
{
public:
	EDS_PickUpType                                Picktype_61_AFA27A9B4C8B64C9C71BEC90A2B9B19B;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Itemname_62_0E18819A47D8C867B9EBD6BB6271D918;      // 0x0008(0x0018)(Edit, BlueprintVisible)
	class FText                                   Itemtypename_63_3F1669E4450D1AC02FBB30A9580BE524;  // 0x0020(0x0018)(Edit, BlueprintVisible)
	class FText                                   Itemdescription_64_A512766840E9DDA1DC7FE7B99D6CE9AD; // 0x0038(0x0018)(Edit, BlueprintVisible)
	EItemType_Enum                                Itemtype_66_71B910214FE62C11DE1F9C9C9A00E515;      // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Amount_67_7650782C49B690C10B4ECAAB70678648;        // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Thumbnail_68_11B954424997B13C7924C6BB821804DC;     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Stackornot_69_FBADA279422AF8117D4E5185133A0FDC;    // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Maximumstackamount_71_AD9A131349B4C25825F19C817855D530; // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Validornot_72_5CDE68174C0482DB204549ACEF7C1B56;    // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ID_32_3F1F3B484308662D9F16F9A29EE065C4;            // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Pickupimage_84_41F4E63F4AE975CCE990C2A912849E17;   // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pickuptime_74_E5716B684E472B2C4E19918710A36F6E;    // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponType                                   WeaponType_75_10BF3352412BE88050042A98FE91FA1F;    // 0x007C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Theclassgeneratedafterpicking_78_23A682654501366BE8DB5E9E0A34AC61; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Pickupsound_76_3ED12DA74E83209C05AD8A8FE87A05EE;   // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Isitaquestitem__77_55273B074560B4ED6548D49F59BDD07D; // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EBulletType_Enum                              BulletType_81_0B4314D44E92B22E8C79348B4F02C358;    // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFull_83_F05CF72D48C4C160FC834791845720F4;        // 0x0092(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FInventoryData_Struct;

}

