#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveCoding

#include "Basic.hpp"

#include "LiveCoding_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class LiveCoding.LiveCodingSettings
// 0x0018 (0x0040 - 0x0028)
class ULiveCodingSettings final : public UObject
{
public:
	bool                                          bEnabled;                                          // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELiveCodingStartupMode                        Startup;                                           // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableReinstancing;                               // 0x002A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutomaticallyCompileNewClasses;                   // 0x002B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreloadEngineModules;                             // 0x002C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreloadEnginePluginModules;                       // 0x002D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreloadProjectModules;                            // 0x002E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreloadProjectPluginModules;                      // 0x002F(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           PreloadNamedModules;                               // 0x0030(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LiveCodingSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LiveCodingSettings")
	}
	static class ULiveCodingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveCodingSettings>();
	}
};
DUMPER7_ASSERTS_ULiveCodingSettings;

}

