#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lockpicking_Settings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Lockpicking_Settings.Lockpicking_Settings
// 0x0028 (0x0028 - 0x0000)
struct FLockpicking_Settings final
{
public:
	float                                         LockTurnSpeed_47_1E6BB1CA4565DC4EE069ABBF7EAA4AB2; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceDistance_2_EB4AF29C4724A149589B738D7BAD972B;  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TraceWhileMoving_5_6BC6CD0140C89C0A35B0A4B74214AD26; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TraceInterval_8_3019EE3249C2B2498BDADDBD4955AB28;  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lock_3_PickDamage_39_BF03744443CCCE676200DEBA4F9D4A56; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lock_2_PickDamage_42_5E86BABE49780E90669EB39BD08C2F12; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lock_1_PickDamage_43_28FF2D0A4E74D7C89F8E2D93383EB0EB; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lock_3_Tolerance_29_5D0109AA4D676FD568DEB1A5AEF94ABD; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lock_2_Tolerance_31_3DAF3D1D45B345DA32CEA9BD6AC32296; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lock_1_Tolerance_33_D237C14A45178F970E51ADB5086DAE1A; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FLockpicking_Settings;

}

