#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMGorder_Enum_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_UMG.MainMenu_UMG_C
// 0x00C8 (0x0328 - 0x0260)
class UMainMenu_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       提示;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_87;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainMenu;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG3_C*                   Producer;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG3_C*                   quit;                                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG3_C*                   Settings;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG3_C*                   Start;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG3_C*                   Story;                                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_4;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_5;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG3_C*                   ThankList;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EUMGorder_Enum                                UMGorder_Enum;                                     // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GameMap;                                           // 0x02D4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDifficultySelection_UMG_C*             DifficultySelection_UMG;                           // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMapSelect_UMG_C*                       MapSelectUMG;                                      // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomCharacterUMG_C*                  CustomCharacterUMG;                                // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomWeapon_UMG_C*                    CustomWeaponUMG;                                   // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACustomCharacter_C*                     CustomCharacterRef;                                // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UthanksList_UMG_C*                      ThanksListUMG;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProducer_Umg_C*                        ProducerUMG;                                       // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USettingUmg_C*                          SettingUmg;                                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          故事模式_;                                     // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MainMenu_UMG(int32 EntryPoint);
	void BndEvt__MainMenu_UMG_Story_K2Node_ComponentBoundEvent_5_Click__DelegateSignature();
	void BndEvt__MainMenu_UMG_Quit_K2Node_ComponentBoundEvent_4_Click__DelegateSignature();
	void BndEvt__MainMenu_UMG_Settings_K2Node_ComponentBoundEvent_3_Click__DelegateSignature();
	void BndEvt__MainMenu_UMG_Producer_K2Node_ComponentBoundEvent_2_Click__DelegateSignature();
	void BndEvt__MainMenu_UMG_ThankList_K2Node_ComponentBoundEvent_1_Click__DelegateSignature();
	void BndEvt__MainMenu_UMG_Start_K2Node_ComponentBoundEvent_0_Click__DelegateSignature();
	void 难度选择返回主界面();
	void 开始游戏();
	void 进入自定义服装界面();
	void 自定义武器返回自定义服装界面();
	void WeaponCustom();
	void 选择地图返回主界面();
	void MapSelect();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void 设置界面返回主界面();
	void 自定义服装返回地图选择();
	void 制作者返回主界面();
	void 感谢名单返回主菜单();
	void Construct();
	void 隐藏主界面(ESlateVisibility InVisibility);
	ESlateVisibility Get_MainMenu_Visibility_0();
	void 不同地图不同角色();
	void 返回主界面(class UWidget* RemoveUI);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MainMenu_UMG_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MainMenu_UMG_C")
	}
	static class UMainMenu_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_UMG_C>();
	}
};
DUMPER7_ASSERTS_UMainMenu_UMG_C;

}

