#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenuPlayerController

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function MainMenuPlayerController.MainMenuPlayerController_C.InpActEvt_Escape_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct MainMenuPlayerController_C_InpActEvt_Escape_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MainMenuPlayerController_C_InpActEvt_Escape_K2Node_InputKeyEvent_1;

// Function MainMenuPlayerController.MainMenuPlayerController_C.InpActEvt_Decimal_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct MainMenuPlayerController_C_InpActEvt_Decimal_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MainMenuPlayerController_C_InpActEvt_Decimal_K2Node_InputKeyEvent_0;

// Function MainMenuPlayerController.MainMenuPlayerController_C.ExecuteUbergraph_MainMenuPlayerController
// 0x0080 (0x0080 - 0x0000)
struct MainMenuPlayerController_C_ExecuteUbergraph_MainMenuPlayerController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMainMenu_UMG_C*>                CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMainMenu_UMG_C*                        CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExitgameConfirmation_UMG_C*            CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UExitgameConfirmation_UMG_C*>    CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0040(0x0018)(HasGetValueTypeHash)
	class UExitgameConfirmation_UMG_C*            CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0060(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_MainMenuPlayerController_C_ExecuteUbergraph_MainMenuPlayerController;

}

