#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickUpKeyboardTips

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function PickUpKeyboardTips.PickUpKeyboardTips_C.ExecuteUbergraph_PickUpKeyboardTips
// 0x0018 (0x0018 - 0x0000)
struct PickUpKeyboardTips_C_ExecuteUbergraph_PickUpKeyboardTips final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_CustomEvent_Texture;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_Circle;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_Keyboard;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PickUpKeyboardTips_C_ExecuteUbergraph_PickUpKeyboardTips;

// Function PickUpKeyboardTips.PickUpKeyboardTips_C.修改拾取图片
// 0x0008 (0x0008 - 0x0000)
struct PickUpKeyboardTips_C_修改拾取图片 final
{
public:
	class UMaterialInterface*                     Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PickUpKeyboardTips_C_修改拾取图片;

// Function PickUpKeyboardTips.PickUpKeyboardTips_C.修改提示
// 0x0002 (0x0002 - 0x0000)
struct PickUpKeyboardTips_C_修改提示 final
{
public:
	ESlateVisibility                              Circle;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              keyboard_0;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PickUpKeyboardTips_C_修改提示;

}

