#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Roller_door_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Roller_door_BP.Roller_door_BP_C
// 0x0030 (0x0250 - 0x0220)
class ARoller_door_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SKM_Roller_door;                                   // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USKM_Roller_door_Anim_C*                As_SKM_Roller_Door_Anim;                           // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABackroom_Quest_BP_C*                   BackroomQuestRef;                                  // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Roller_door_BP(int32 EntryPoint);
	void 彻底关闭卷帘门();
	void 关闭卷帘门();
	void 卷帘门完全开启();
	void 开启卷帘门();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Roller_door_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Roller_door_BP_C")
	}
	static class ARoller_door_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARoller_door_BP_C>();
	}
};
DUMPER7_ASSERTS_ARoller_door_BP_C;

}

