#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SourceControl

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class SourceControl.SourceControlHelpers
// 0x0000 (0x0028 - 0x0028)
class USourceControlHelpers final : public UObject
{
public:
	static void AsyncQueryFileState(TDelegate<void(const struct FSourceControlState& FileStateOut)> FileStateCallback, const class FString& InFile, bool bSilent);
	static bool CheckInFile(const class FString& InFile, const class FString& InDescription, bool bSilent, bool bKeepCheckedOut);
	static bool CheckInFiles(const TArray<class FString>& InFiles, const class FString& InDescription, bool bSilent, bool bKeepCheckedOut);
	static bool CheckOutFile(const class FString& InFile, bool bSilent);
	static bool CheckOutFiles(const TArray<class FString>& InFiles, bool bSilent);
	static bool CheckOutOrAddFile(const class FString& InFile, bool bSilent);
	static bool CheckOutOrAddFiles(const TArray<class FString>& InFiles, bool bSilent);
	static bool CopyFile(const class FString& InSourceFile, const class FString& InDestFile, bool bSilent);
	static class FString CurrentProvider();
	static bool IsAvailable();
	static bool IsEnabled();
	static class FText LastErrorMsg();
	static bool MarkFileForAdd(const class FString& InFile, bool bSilent);
	static bool MarkFileForDelete(const class FString& InFile, bool bSilent);
	static bool MarkFilesForAdd(const TArray<class FString>& InFiles, bool bSilent);
	static bool MarkFilesForDelete(const TArray<class FString>& InFiles, bool bSilent);
	static struct FSourceControlState QueryFileState(const class FString& InFile, bool bSilent);
	static bool RevertFile(const class FString& InFile, bool bSilent);
	static bool RevertFiles(const TArray<class FString>& InFiles, bool bSilent);
	static bool RevertUnchangedFile(const class FString& InFile, bool bSilent);
	static bool RevertUnchangedFiles(const TArray<class FString>& InFiles, bool bSilent);
	static bool SyncFile(const class FString& InFile, bool bSilent);
	static bool SyncFiles(const TArray<class FString>& InFiles, bool bSilent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SourceControlHelpers")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SourceControlHelpers")
	}
	static class USourceControlHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<USourceControlHelpers>();
	}
};
DUMPER7_ASSERTS_USourceControlHelpers;

// Class SourceControl.SourceControlPreferences
// 0x0068 (0x00A0 - 0x0038)
class USourceControlPreferences final : public UDeveloperSettings
{
public:
	bool                                          bEnableValidationTag;                              // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldDeleteNewFilesOnRevert;                     // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableUncontrolledChangelists;                    // 0x003A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CollectionChangelistTags;                          // 0x0040(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TMap<class FName, class FString>              SpecificCollectionChangelistTags;                  // 0x0050(0x0050)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SourceControlPreferences")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SourceControlPreferences")
	}
	static class USourceControlPreferences* GetDefaultObj()
	{
		return GetDefaultObjImpl<USourceControlPreferences>();
	}
};
DUMPER7_ASSERTS_USourceControlPreferences;

}

