#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Subtitles_UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Subtitles_UMG.Subtitles_UMG_C
// 0x0070 (0x02D0 - 0x0260)
class USubtitles_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_59;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             who;                                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        Audio;                                             // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USoundBase*>                     Sound;                                             // 0x0288(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class FText>                           In_Text;                                           // 0x0298(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              Finish;                                            // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          中途暂停; // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           谁说话; // 0x02C0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_Subtitles_UMG(int32 EntryPoint);
	void 中途结束();
	void Construct();
	void 说完话();
	void 更新字幕();
	void 剧情字幕(class USoundBase* Sound_0, const class FText& 谁说话_0, const class FText& InText, int32 几段音频, class UAudioComponent** Output_Get);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Subtitles_UMG_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Subtitles_UMG_C")
	}
	static class USubtitles_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubtitles_UMG_C>();
	}
};
DUMPER7_ASSERTS_USubtitles_UMG_C;

}

