#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToolMenus

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Enum ToolMenus.EToolMenuStringCommandType
// NumValues: 0x0004
enum class EToolMenuStringCommandType : uint8
{
	Command                                  = 0,
	Python                                   = 1,
	Custom                                   = 2,
	EToolMenuStringCommandType_MAX           = 3,
};

// Enum ToolMenus.EToolMenuInsertType
// NumValues: 0x0005
enum class EToolMenuInsertType : uint8
{
	Default                                  = 0,
	Before                                   = 1,
	After                                    = 2,
	First                                    = 3,
	EToolMenuInsertType_MAX                  = 4,
};

// ScriptStruct ToolMenus.ToolMenuInsert
// 0x000C (0x000C - 0x0000)
struct FToolMenuInsert final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EToolMenuInsertType                           Position;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FToolMenuInsert;

// ScriptStruct ToolMenus.ToolMenuContext
// 0x0068 (0x0068 - 0x0000)
struct FToolMenuContext final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        ContextObjects;                                    // 0x0008(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18[0x50];                                      // 0x0018(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FToolMenuContext;

// ScriptStruct ToolMenus.ToolDynamicUIAction
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x08) FToolDynamicUIAction final
{
public:
	TDelegate<void(const struct FToolMenuContext& Context)> ExecuteAction;                           // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FToolMenuContext& Context)> CanExecuteAction;                        // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FToolMenuContext& Context)> GetActionCheckState;                     // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FToolMenuContext& Context)> IsActionVisibleDelegate;                 // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FToolDynamicUIAction;

// ScriptStruct ToolMenus.ToolMenuStringCommand
// 0x0020 (0x0020 - 0x0000)
struct FToolMenuStringCommand final
{
public:
	EToolMenuStringCommandType                    Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CustomType;                                        // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 String;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FToolMenuStringCommand;

// ScriptStruct ToolMenus.ToolMenuOwner
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FToolMenuOwner final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FToolMenuOwner;

// ScriptStruct ToolMenus.ToolMenuEntry
// 0x03E0 (0x03E0 - 0x0000)
struct FToolMenuEntry final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FToolMenuOwner                         Owner;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMultiBlockType                               Type;                                              // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUserInterfaceActionType                      UserInterfaceActionType;                           // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TutorialHighlightName;                             // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FToolMenuInsert                        InsertPosition;                                    // 0x0024(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bShouldCloseWindowAfterMenuSelection;              // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UToolMenuEntryScript*                   ScriptObject;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StyleNameOverride;                                 // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x391];                                     // 0x0048(0x0391)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCommandIsKeybindOnly;                             // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3DA[0x6];                                      // 0x03DA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FToolMenuEntry;

// ScriptStruct ToolMenus.ScriptSlateIcon
// 0x0018 (0x0018 - 0x0000)
struct FScriptSlateIcon final
{
public:
	class FName                                   StyleSetName;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StyleName;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SmallStyleName;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FScriptSlateIcon;

// ScriptStruct ToolMenus.ToolMenuEntryScriptDataAdvanced
// 0x0018 (0x0018 - 0x0000)
struct FToolMenuEntryScriptDataAdvanced final
{
public:
	class FName                                   TutorialHighlight;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMultiBlockType                               EntryType;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUserInterfaceActionType                      UserInterfaceActionType;                           // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   StyleNameOverride;                                 // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSubMenu;                                        // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpenSubMenuOnClick;                               // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldCloseWindowAfterMenuSelection;              // 0x0016(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimpleComboBox;                                   // 0x0017(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FToolMenuEntryScriptDataAdvanced;

// ScriptStruct ToolMenus.ToolMenuEntryScriptData
// 0x0090 (0x0090 - 0x0000)
struct FToolMenuEntryScriptData final
{
public:
	class FName                                   Menu;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Section;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Label;                                             // 0x0018(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   ToolTip;                                           // 0x0030(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScriptSlateIcon                       Icon;                                              // 0x0048(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OwnerName;                                         // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FToolMenuInsert                        InsertPosition;                                    // 0x0068(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FToolMenuEntryScriptDataAdvanced       Advanced;                                          // 0x0074(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FToolMenuEntryScriptData;

// ScriptStruct ToolMenus.ToolMenuSection
// 0x0130 (0x0130 - 0x0000)
struct FToolMenuSection final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FToolMenuOwner                         Owner;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FToolMenuEntry>                 Blocks;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FToolMenuInsert                        InsertPosition;                                    // 0x0028(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FToolMenuContext                       Context;                                           // 0x0038(0x0068)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UToolMenuSectionDynamic*                ToolMenuSectionDynamic;                            // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x88];                                      // 0x00A8(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FToolMenuSection;

}

