#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToolMenus

#include "Basic.hpp"

#include "ToolMenus_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ToolMenus.ToolMenu.AddDynamicSectionScript
// 0x0010 (0x0010 - 0x0000)
struct ToolMenu_AddDynamicSectionScript final
{
public:
	class FName                                   SectionName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UToolMenuSectionDynamic*                Object;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenu_AddDynamicSectionScript;

// Function ToolMenus.ToolMenu.AddMenuEntry
// 0x03E8 (0x03E8 - 0x0000)
struct ToolMenu_AddMenuEntry final
{
public:
	class FName                                   SectionName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FToolMenuEntry                         Args;                                              // 0x0008(0x03E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenu_AddMenuEntry;

// Function ToolMenus.ToolMenu.AddMenuEntryObject
// 0x0008 (0x0008 - 0x0000)
struct ToolMenu_AddMenuEntryObject final
{
public:
	class UToolMenuEntryScript*                   InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenu_AddMenuEntryObject;

// Function ToolMenus.ToolMenu.AddSectionScript
// 0x0030 (0x0030 - 0x0000)
struct ToolMenu_AddSectionScript final
{
public:
	class FName                                   SectionName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Label;                                             // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   InsertName;                                        // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EToolMenuInsertType                           InsertType;                                        // 0x0028(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ToolMenu_AddSectionScript;

// Function ToolMenus.ToolMenu.AddSubMenuScript
// 0x0050 (0x0050 - 0x0000)
struct ToolMenu_AddSubMenuScript final
{
public:
	class FName                                   Owner;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SectionName;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Label;                                             // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ToolTip;                                           // 0x0030(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UToolMenu*                              ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenu_AddSubMenuScript;

// Function ToolMenus.ToolMenu.InitMenu
// 0x0028 (0x0028 - 0x0000)
struct ToolMenu_InitMenu final
{
public:
	struct FToolMenuOwner                         Owner;                                             // 0x0000(0x0010)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Parent;                                            // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMultiBoxType                                 Type;                                              // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ToolMenu_InitMenu;

// Function ToolMenus.ToolMenuEntryScript.ConstructMenuEntry
// 0x0078 (0x0078 - 0x0000)
struct ToolMenuEntryScript_ConstructMenuEntry final
{
public:
	class UToolMenu*                              Menu;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SectionName;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FToolMenuContext                       Context;                                           // 0x0010(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryScript_ConstructMenuEntry;

// Function ToolMenus.ToolMenuEntryScript.Execute
// 0x0068 (0x0068 - 0x0000)
struct ToolMenuEntryScript_Execute final
{
public:
	struct FToolMenuContext                       Context;                                           // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryScript_Execute;

// Function ToolMenus.ToolMenuEntryScript.InitEntry
// 0x0050 (0x0050 - 0x0000)
struct ToolMenuEntryScript_InitEntry final
{
public:
	class FName                                   OwnerName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Menu;                                              // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Section;                                           // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Label;                                             // 0x0020(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ToolTip;                                           // 0x0038(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryScript_InitEntry;

// Function ToolMenus.ToolMenuEntryScript.CanExecute
// 0x0070 (0x0070 - 0x0000)
struct ToolMenuEntryScript_CanExecute final
{
public:
	struct FToolMenuContext                       Context;                                           // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ToolMenuEntryScript_CanExecute;

// Function ToolMenus.ToolMenuEntryScript.GetCheckState
// 0x0070 (0x0070 - 0x0000)
struct ToolMenuEntryScript_GetCheckState final
{
public:
	struct FToolMenuContext                       Context;                                           // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ECheckBoxState                                ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ToolMenuEntryScript_GetCheckState;

// Function ToolMenus.ToolMenuEntryScript.GetIcon
// 0x0080 (0x0080 - 0x0000)
struct ToolMenuEntryScript_GetIcon final
{
public:
	struct FToolMenuContext                       Context;                                           // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FScriptSlateIcon                       ReturnValue;                                       // 0x0068(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryScript_GetIcon;

// Function ToolMenus.ToolMenuEntryScript.GetLabel
// 0x0080 (0x0080 - 0x0000)
struct ToolMenuEntryScript_GetLabel final
{
public:
	struct FToolMenuContext                       Context;                                           // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0068(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryScript_GetLabel;

// Function ToolMenus.ToolMenuEntryScript.GetToolTip
// 0x0080 (0x0080 - 0x0000)
struct ToolMenuEntryScript_GetToolTip final
{
public:
	struct FToolMenuContext                       Context;                                           // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0068(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryScript_GetToolTip;

// Function ToolMenus.ToolMenuEntryScript.IsVisible
// 0x0070 (0x0070 - 0x0000)
struct ToolMenuEntryScript_IsVisible final
{
public:
	struct FToolMenuContext                       Context;                                           // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ToolMenuEntryScript_IsVisible;

// Function ToolMenus.ToolMenus.AddMenuEntryObject
// 0x0010 (0x0010 - 0x0000)
struct ToolMenus_AddMenuEntryObject final
{
public:
	class UToolMenuEntryScript*                   MenuEntryObject;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ToolMenus_AddMenuEntryObject;

// Function ToolMenus.ToolMenus.FindContext
// 0x0078 (0x0078 - 0x0000)
struct ToolMenus_FindContext final
{
public:
	struct FToolMenuContext                       InContext;                                         // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UClass*                                 InClass;                                           // 0x0068(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenus_FindContext;

// Function ToolMenus.ToolMenus.Get
// 0x0008 (0x0008 - 0x0000)
struct ToolMenus_Get final
{
public:
	class UToolMenus*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenus_Get;

// Function ToolMenus.ToolMenus.ExtendMenu
// 0x0010 (0x0010 - 0x0000)
struct ToolMenus_ExtendMenu final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UToolMenu*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenus_ExtendMenu;

// Function ToolMenus.ToolMenus.FindMenu
// 0x0010 (0x0010 - 0x0000)
struct ToolMenus_FindMenu final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UToolMenu*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenus_FindMenu;

// Function ToolMenus.ToolMenus.RefreshMenuWidget
// 0x000C (0x000C - 0x0000)
struct ToolMenus_RefreshMenuWidget final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ToolMenus_RefreshMenuWidget;

// Function ToolMenus.ToolMenus.RegisterMenu
// 0x0020 (0x0020 - 0x0000)
struct ToolMenus_RegisterMenu final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Parent;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMultiBoxType                                 Type;                                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWarnIfAlreadyRegistered;                          // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UToolMenu*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenus_RegisterMenu;

// Function ToolMenus.ToolMenus.RemoveEntry
// 0x0018 (0x0018 - 0x0000)
struct ToolMenus_RemoveEntry final
{
public:
	class FName                                   MenuName;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Section;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenus_RemoveEntry;

// Function ToolMenus.ToolMenus.RemoveMenu
// 0x0008 (0x0008 - 0x0000)
struct ToolMenus_RemoveMenu final
{
public:
	class FName                                   MenuName;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenus_RemoveMenu;

// Function ToolMenus.ToolMenus.RemoveSection
// 0x0010 (0x0010 - 0x0000)
struct ToolMenus_RemoveSection final
{
public:
	class FName                                   MenuName;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Section;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenus_RemoveSection;

// Function ToolMenus.ToolMenus.SetSectionLabel
// 0x0028 (0x0028 - 0x0000)
struct ToolMenus_SetSectionLabel final
{
public:
	class FName                                   MenuName;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SectionName;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Label;                                             // 0x0010(0x0018)(ConstParm, Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenus_SetSectionLabel;

// Function ToolMenus.ToolMenus.SetSectionPosition
// 0x001C (0x001C - 0x0000)
struct ToolMenus_SetSectionPosition final
{
public:
	class FName                                   MenuName;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SectionName;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OtherSectionName;                                  // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EToolMenuInsertType                           PositionType;                                      // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ToolMenus_SetSectionPosition;

// Function ToolMenus.ToolMenus.UnregisterOwnerByName
// 0x0008 (0x0008 - 0x0000)
struct ToolMenus_UnregisterOwnerByName final
{
public:
	class FName                                   InOwnerName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenus_UnregisterOwnerByName;

// Function ToolMenus.ToolMenus.IsMenuRegistered
// 0x000C (0x000C - 0x0000)
struct ToolMenus_IsMenuRegistered final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ToolMenus_IsMenuRegistered;

// Function ToolMenus.ToolMenuContextExtensions.FindByClass
// 0x0078 (0x0078 - 0x0000)
struct ToolMenuContextExtensions_FindByClass final
{
public:
	struct FToolMenuContext                       Context;                                           // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    InClass;                                           // 0x0068(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuContextExtensions_FindByClass;

// Function ToolMenus.ToolMenuEntryExtensions.BreakScriptSlateIcon
// 0x0030 (0x0030 - 0x0000)
struct ToolMenuEntryExtensions_BreakScriptSlateIcon final
{
public:
	struct FScriptSlateIcon                       InValue;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   StyleSetName;                                      // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StyleName;                                         // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SmallStyleName;                                    // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryExtensions_BreakScriptSlateIcon;

// Function ToolMenus.ToolMenuEntryExtensions.BreakStringCommand
// 0x0040 (0x0040 - 0x0000)
struct ToolMenuEntryExtensions_BreakStringCommand final
{
public:
	struct FToolMenuStringCommand                 InValue;                                           // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EToolMenuStringCommandType                    Type;                                              // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CustomType;                                        // 0x0024(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 String;                                            // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryExtensions_BreakStringCommand;

// Function ToolMenus.ToolMenuEntryExtensions.BreakToolMenuOwner
// 0x0018 (0x0018 - 0x0000)
struct ToolMenuEntryExtensions_BreakToolMenuOwner final
{
public:
	struct FToolMenuOwner                         InValue;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryExtensions_BreakToolMenuOwner;

// Function ToolMenus.ToolMenuEntryExtensions.GetLabel
// 0x03F8 (0x03F8 - 0x0000)
struct ToolMenuEntryExtensions_GetLabel final
{
public:
	struct FToolMenuEntry                         Target;                                            // 0x0000(0x03E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x03E0(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryExtensions_GetLabel;

// Function ToolMenus.ToolMenuEntryExtensions.GetToolTip
// 0x03F8 (0x03F8 - 0x0000)
struct ToolMenuEntryExtensions_GetToolTip final
{
public:
	struct FToolMenuEntry                         Target;                                            // 0x0000(0x03E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x03E0(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryExtensions_GetToolTip;

// Function ToolMenus.ToolMenuEntryExtensions.InitMenuEntry
// 0x0440 (0x0440 - 0x0000)
struct ToolMenuEntryExtensions_InitMenuEntry final
{
public:
	class FName                                   InOwner;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InName;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   InLabel;                                           // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   InToolTip;                                         // 0x0028(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EToolMenuStringCommandType                    CommandType;                                       // 0x0040(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CustomCommandType;                                 // 0x0044(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CommandString;                                     // 0x0050(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FToolMenuEntry                         ReturnValue;                                       // 0x0060(0x03E0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryExtensions_InitMenuEntry;

// Function ToolMenus.ToolMenuEntryExtensions.MakeScriptSlateIcon
// 0x0030 (0x0030 - 0x0000)
struct ToolMenuEntryExtensions_MakeScriptSlateIcon final
{
public:
	class FName                                   StyleSetName;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StyleName;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SmallStyleName;                                    // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScriptSlateIcon                       ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryExtensions_MakeScriptSlateIcon;

// Function ToolMenus.ToolMenuEntryExtensions.MakeStringCommand
// 0x0040 (0x0040 - 0x0000)
struct ToolMenuEntryExtensions_MakeStringCommand final
{
public:
	EToolMenuStringCommandType                    Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CustomType;                                        // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 String;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FToolMenuStringCommand                 ReturnValue;                                       // 0x0020(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryExtensions_MakeStringCommand;

// Function ToolMenus.ToolMenuEntryExtensions.MakeToolMenuOwner
// 0x0018 (0x0018 - 0x0000)
struct ToolMenuEntryExtensions_MakeToolMenuOwner final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FToolMenuOwner                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryExtensions_MakeToolMenuOwner;

// Function ToolMenus.ToolMenuEntryExtensions.SetIcon
// 0x03F8 (0x03F8 - 0x0000)
struct ToolMenuEntryExtensions_SetIcon final
{
public:
	struct FToolMenuEntry                         Target;                                            // 0x0000(0x03E0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   StyleSetName;                                      // 0x03E0(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StyleName;                                         // 0x03E8(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SmallStyleName;                                    // 0x03F0(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryExtensions_SetIcon;

// Function ToolMenus.ToolMenuEntryExtensions.SetLabel
// 0x03F8 (0x03F8 - 0x0000)
struct ToolMenuEntryExtensions_SetLabel final
{
public:
	struct FToolMenuEntry                         Target;                                            // 0x0000(0x03E0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Label;                                             // 0x03E0(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryExtensions_SetLabel;

// Function ToolMenus.ToolMenuEntryExtensions.SetStringCommand
// 0x0400 (0x0400 - 0x0000)
struct ToolMenuEntryExtensions_SetStringCommand final
{
public:
	struct FToolMenuEntry                         Target;                                            // 0x0000(0x03E0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EToolMenuStringCommandType                    Type;                                              // 0x03E0(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CustomType;                                        // 0x03E4(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 String;                                            // 0x03F0(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryExtensions_SetStringCommand;

// Function ToolMenus.ToolMenuEntryExtensions.SetToolTip
// 0x03F8 (0x03F8 - 0x0000)
struct ToolMenuEntryExtensions_SetToolTip final
{
public:
	struct FToolMenuEntry                         Target;                                            // 0x0000(0x03E0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ToolTip;                                           // 0x03E0(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuEntryExtensions_SetToolTip;

// Function ToolMenus.ToolMenuSectionExtensions.AddEntry
// 0x0510 (0x0510 - 0x0000)
struct ToolMenuSectionExtensions_AddEntry final
{
public:
	struct FToolMenuSection                       Section;                                           // 0x0000(0x0130)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FToolMenuEntry                         Args;                                              // 0x0130(0x03E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuSectionExtensions_AddEntry;

// Function ToolMenus.ToolMenuSectionExtensions.AddEntryObject
// 0x0138 (0x0138 - 0x0000)
struct ToolMenuSectionExtensions_AddEntryObject final
{
public:
	struct FToolMenuSection                       Section;                                           // 0x0000(0x0130)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UToolMenuEntryScript*                   InObject;                                          // 0x0130(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuSectionExtensions_AddEntryObject;

// Function ToolMenus.ToolMenuSectionExtensions.GetLabel
// 0x0148 (0x0148 - 0x0000)
struct ToolMenuSectionExtensions_GetLabel final
{
public:
	struct FToolMenuSection                       Section;                                           // 0x0000(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0130(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuSectionExtensions_GetLabel;

// Function ToolMenus.ToolMenuSectionExtensions.SetLabel
// 0x0148 (0x0148 - 0x0000)
struct ToolMenuSectionExtensions_SetLabel final
{
public:
	struct FToolMenuSection                       Section;                                           // 0x0000(0x0130)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Label;                                             // 0x0130(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuSectionExtensions_SetLabel;

// Function ToolMenus.ToolMenuSectionDynamic.ConstructSections
// 0x0070 (0x0070 - 0x0000)
struct ToolMenuSectionDynamic_ConstructSections final
{
public:
	class UToolMenu*                              Menu;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FToolMenuContext                       Context;                                           // 0x0008(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ToolMenuSectionDynamic_ConstructSections;

}

