#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_ChacraterData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct UDS_ChacraterData.UDS_ChacraterData
// 0x0058 (0x0058 - 0x0000)
struct FUDS_ChacraterData final
{
public:
	class USoundBase*                             BreathingHeavy_2_BB03C5A34E266696B08AFE8B4F5219B7; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             BreathingSoft_4_7533FF154A638D61547BE1BE24A1FCB1;  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             受伤音效_30_B3B1EE604D56D613324C1E8BF7235F81;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             跳跃音效_29_C39A2CCF4978BA6E59D30FA9025375DC;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             攻击音效_28_756E066F4FB6AE42EFD19A955166D88C;  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             死亡音效_27_3821AFA84AFB7C0C03818E8E4ABBF10B;  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         弹簧臂Z轴_26_25FDC4984ACDD4C53AA99B9B714D38AA; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         弹簧臂Y轴_25_0D2832804F8C11C9E267A5AC1FE4409E; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         武器大小_43_583E793C47FF71F83146438ECCA83816;  // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         人物大小_44_1E8325CB40741DBEB46E5CA097073963;  // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         模型高度_42_752F0CE544A0F610B10DFDB54E463CAD;  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          是否显示背包模型_35_C5EE85A444674140EC8E16BB7971BD3C; // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          背包模型_38_595B0D7943CF958D41DC318AAACD14A5;  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicsAsset*                          物理资产_41_5526956549A9D16DCA7A29820DD31BB7;  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FUDS_ChacraterData;

}

