#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UEDemo

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class UEDemo.UEDemoCharacter
// 0x0030 (0x06E0 - 0x06B0)
class AUEDemoCharacter : public ACharacter
{
public:
	class USpringArmComponent*                    CameraBoom;                                        // 0x06A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraComponent*                       FollowCamera;                                      // 0x06B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInputMappingContext*                   DefaultMappingContext;                             // 0x06B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInputAction*                           JumpAction;                                        // 0x06C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInputAction*                           MoveAction;                                        // 0x06C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInputAction*                           LookAction;                                        // 0x06D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6D8[0x8];                                      // 0x06D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UEDemoCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UEDemoCharacter")
	}
	static class AUEDemoCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUEDemoCharacter>();
	}
};
DUMPER7_ASSERTS_AUEDemoCharacter;

// Class UEDemo.UEDemoGameMode
// 0x0000 (0x0348 - 0x0348)
class AUEDemoGameMode final : public AGameModeBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UEDemoGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UEDemoGameMode")
	}
	static class AUEDemoGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUEDemoGameMode>();
	}
};
DUMPER7_ASSERTS_AUEDemoGameMode;

}

