#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponSlot_UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WeaponType_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WeaponSlot_UMG.WeaponSlot_UMG_C
// 0x0060 (0x02C0 - 0x0260)
class UWeaponSlot_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       One;                                               // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_259;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_486;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_157;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             WeaponTexture;                                     // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EWeaponType                                   WeaponType;                                        // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   WeaponName;                                        // 0x02A0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          是否被选中;                                   // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WeaponSlot_UMG(int32 EntryPoint);
	void 关闭所有武器选择();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__Button_259_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_259_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_259_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void 关闭所有配件详情选择();
	void 关闭所有配件种类选择();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WeaponSlot_UMG_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeaponSlot_UMG_C")
	}
	static class UWeaponSlot_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponSlot_UMG_C>();
	}
};
DUMPER7_ASSERTS_UWeaponSlot_UMG_C;

}

